#Feature: Импорт сломанных GeoPackage
#
#  Background:
#    Given Существует любая организация
#    *     Владелец организации авторизован
#
#  Scenario: Импорт GeoPackage со схемой без генерируемых атрибутов БЕЗ УКАЗАНИЯ набора данных с 2умя сломанными геометриями проходит успешно
#    Given Существует и авторизован некий пользователь
#    *     Существует проект "I need to IMPORT geoPackage without dataset and with some broken geom"
#    *     Загружены файлы "some_geom_broken.gpkg"
#    When  Текущий пользователь импортирует GeoPackage в текущий проект без указания набора данных
#    Then  Сервер отвечает со статус-кодом 202
#    *     процесс завершается успешно
#    *     в текущий проект подключен 1 слой
#    *     количество объектов в слое равно 4
#    And   атрибуты объекта с полем "objectid" равным 1 такие
#      | field_int           | 12                                                                                          |
#      | field_double        | 12.12000000                                                                                 |
#      | field_string        | Ты один создан гдал-ом                                                                      |
#      | field_date          | 2025-09-03 00:00:00                                                                         |
#      | field_boolean       | true                                                                                        |
#      | field_choice_string | 1111                                                                                        |
#      | field_choice_int    | 55                                                                                          |
#      | field_url           | [{"url":"https://blank.com","text":"gt"}]                                                   |
#      | field_fias          |                                                                                             |
#      | field_fias__oktmo   | 58                                                                                          |
#      | field_fias__address | Радуемся                                                                                    |
#      | field_fias__id      | 85                                                                                          |
#      | ruleid              | 96                                                                                          |
#      | field_file          | [{id=2b3e1dfb-9fa7-40df-ba88-b7c419c1f9f4, title=empty.xlsx, size=4336}]                    |
#      | field_document      | [{"id":1,"title":"dw","libraryTableName":"dl_data_kpt"}]                                    |
#      | field_uuid          | cfbde192-08a8-4f0b-bd09-a0e417ec11ef                                                        |
#      | field_user_id       | 2                                                                                           |
#      | field_user          | [{"id":2,"email":"orgOwner@any.ru","name":"Владелец","surname":"orgOwner","middleName":""}] |
##      3104
##      | shape               | 0106000020F66E0000010000000103000000010000000B000000A2F65AD00265594138C6BB59861253412E1941340B6559415A8C796286125341D99D22600B655941FC0B105394125341B070760E096559410BCED44B94125341F06A010F09655941CB7E66848E1253412BF1726B04655941877B59878E125341E8E3497304655941A81C75038C125341978580F3086559413993E2228C1253411075D2B708655941EBBCB6DE881253410CB2A5EB026559419DE3A5CC88125341A2F65AD00265594138C6BB5986125341 |
#    *   атрибуты объекта с полем "objectid" равным 2 такие
#      | field_string | невозможно |
#      #      3104
##      | shape        | 0106000020F66E0000010000000103000000010000000B000000B7D100DA056559418CB96B119A1253411C7C6176FD6459413FC6DCED99125341BB270F77FD645941933A01FD8B125341075F98C8FF64594154E3A50B8C1253414FAF94B5FF645941D8F0F4D291125341BDE3145904655941ABCFD5DE91125341EA043449046559417446946294125341FED478C9FF645941A69BC434941253410F0BB5FAFF645941E4839E7997125341DE718AC605655941EBE2369E97125341B7D100DA056559418CB96B119A125341 |
#    *   атрибуты объекта с полем "objectid" равным 3 такие
#      | field_string | Пустая геометрия |
#      | shape        |                  |
#    *   атрибуты объекта с полем "objectid" равным 4 такие
#      | field_string  | Тебя ВОЗМОЖНО починить |
#      #      3104
##      | shape         | 0106000020F66E00000700000001030000000100000004000000945D424B0065594132B6704797125341B45C2EFF02655941EDE1D546971253416F53455900655941AE97E3F594125341945D424B0065594132B67047971253410103000000010000000400000043DF7330036559411F84EE7197125341C5EBF564036559418E1BBF4697125341B45C2EFF02655941EDE1D5469712534143DF7330036559411F84EE719712534101030000000100000006000000C5EBF564036559418E1BBF4697125341C45D6B0C0A65594116EE414597125341138163820865594172FEC9F2941253416FC7CD9608655941D07967E3921253412758992006655941D044540795125341C5EBF564036559418E1BBF4697125341010300000001000000040000006FC7CD9608655941D07967E39212534101C651BC086559413562C9C292125341D346539908655941DE5044A2921253416FC7CD9608655941D07967E392125341010300000001000000040000003466F9AE086559414E7E027390125341F4870930066559419E1BA06490125341D346539908655941DE5044A2921253413466F9AE086559414E7E027390125341010300000001000000040000007BDC94300A6559419294D07B97125341354958500A65594106BB324597125341C45D6B0C0A65594116EE4145971253417BDC94300A6559419294D07B971253410103000000010000000600000020941D3C0E655941B51E524497125341BC72635D0E655941E268A9E08E125341BA0034EA0B6559419BA6CAF48E12534181E02FC70B65594192CEA9C094125341354958500A65594106BB32459712534120941D3C0E655941B51E524497125341 |
#      | field_boolean | false                  |
#      | field_date    | 2025-09-02 21:00:00    |
#    * пользователь опрашивает процесс
#    * В ответе процесса содержится фраза "После импорта геометрии было обнаружено '1' записей с неправильной геометрией"
