# Нет возможности написать тест без создания реальных таблиц
#Feature: Создание файлов для объектов слоя
#
#  Background:
#    Given Существует организация
#      | ООО НаборыДанных | 1234567890 | Наборов | Набор | EMAIL_13 | testPassword1 |
#    Given Авторизируемся владельцем организации
#
#  Scenario: Пользователю разрешается создавать файлы для обьекта слоя к которому у него есть доступ
#    When
#    Then
#
#  Scenario: Пользователю запрещается создавать файлы для обьекта слоя к которому у него нет доступа
#    When
#    Then
