import { describe, expect, test } from '@jest/globals';

import { extractCoordinates } from './extractCoordinates.util';

const csv = `"4961648.06";"5202592.67"
"4961592.96";"5202834.73"
"4961460.96";"5202800.38"
"4961489.46";"5202743.75"
"4961578.92";"5202640.38"
"4961648.06";"5202592.67"`;

describe('утилита конвертации csv в массив координат', () => {
  test('объекты из csv корректно преобразуются в массив координат', () => {
    const output = [
      [5_202_592.67, 4_961_648.06],
      [5_202_834.73, 4_961_592.96],
      [5_202_800.38, 4_961_460.96],
      [5_202_743.75, 4_961_489.46],
      [5_202_640.38, 4_961_578.92],
      [5_202_592.67, 4_961_648.06]
    ];

    expect(extractCoordinates(csv)).toStrictEqual(output);
  });
});
