import { GeometryType, type NewWfsFeature } from '../../../../../src/app/services/geoserver/wfs/wfs.models';

export const polarStar: NewWfsFeature[] = [
  {
    type: 'Feature',
    geometry: {
      type: GeometryType.MULTI_LINE_STRING,
      coordinates: [
        // Центральная точка и луч вверх
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_817, 5_000_028] // верхний луч
        ],
        // Центральная точка и луч вправо-вверх
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_827, 5_000_028] // правый-верхний луч
        ],
        // Центральная точка и луч вправо
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_827, 5_000_018] // правый луч
        ],
        // Центральная точка и луч вправо-вниз
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_827, 5_000_008] // правый-нижний луч
        ],
        // Центральная точка и луч вниз
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_817, 5_000_008] // нижний луч
        ],
        // Центральная точка и луч влево-вниз
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_807, 5_000_008] // левый-нижний луч
        ],
        // Центральная точка и луч влево
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_807, 5_000_018] // левый луч
        ],
        // Центральная точка и луч влево-вверх
        [
          [6_656_817, 5_000_018], // центр звезды
          [6_656_807, 5_000_028] // левый-верхний луч
        ]
      ]
    },
    properties: {}
  }
];
