INSERT INTO
    CRG_TABLE_TEMPLATE (
        objectid,
        location,
        size,
        inf_area,
        response,
        doc,
        photo,
        shape
    )
VALUES
(
        '1',
          'Район Хазарского переулка',
        '3 на 4 метра',
        '12',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000986E122344CA5341D6C56DF880FA5241'
    ),
(
        '2',
          'ТРЦ Меганом',
        '3 на 4 метра',
        '12',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000BB270F3B7ACA5341ED0DBE2837FA5241'
    ),
(
        '3',
          'ТРЦ Меганом',
        '8 на 12 метров',
        '16',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000C3F528E46DCA5341E86A2B0608F95241'
    ),
(
        '4',
          'ТРЦ Меганом',
        '3 на 4 метра',
        '11',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000E71DA7F475CA53411EA7E8F4EFF85241'
    ),
(
        '5',
          'Московское кольцо',
        '6 на 6 метров',
        '23',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000D712F2ADA8CA5341C05B202122F95241'
    ),
(
        '6',
          'Московское кольцо',
        '7 на 2 метра',
        '34',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000B4C876AEB4CA5341E17A147E06F95241'
    ),
(
        '7',
          'Московское кольцо',
        '3 на 4 метра',
        '11',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000F8C264B65ECC5341984C15F022F85241'
    ),
(
        '8',
          'Троллейбусный парк',
        '8 на 12 метров',
        '32',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000FDF675A487CB5341D734EFFC98F85241'
    ),
(
        '9',
          'Троллейбусный парк',
        '7 на 2 метра',
        '14',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E000001000000010100000040A4DF02B6CC5341499D80F2ACF75241'
    ),
(
        '10',
          'Район Куйбышевского кольца',
        '3 на 4 метра',
        '12',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E000001000000010100000075029A84B2CC53412A3A925BB9F75241'
    ),
(
        '11',
          'Район Куйбышевского кольца',
        '6 на 6 метров',
        '32',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E00000100000001010000000A6822B0A2CC5341B1506BF2B1F75241'
    ),
(
        '12',
          'Район Куйбышевского кольца',
        '2 на 2 метра',
        '22',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E000001000000010100000041F16390D0CC534167D5E756AEF75241'
    ),
(
        '13',
          'Район Куйбышевского кольца',
        '8 на 12 метров',
        '12',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E0000010000000101000000E6AE25BCE5CC53413E795804A9F75241'
    ),
(
        '14',
          'Район Куйбышевского кольца',
        '2 на 2 метра',
        '4',
        'Умеров',
        '[{"id": "c690f81f-a80e-44ce-895f-ce51aed3ee2b", "size": 320699, "title": "пример документ.pdf"}]'::jsonb,
        '[{"id": "a3ab951c-3795-42a6-8691-2e2d53cdc583", "size": 631568, "title": "пример фото.pdf"}]'::jsonb,
        '0104000020951E00000100000001010000000E4FAF6CE9CC5341B4C876F696F75241'
    );