<?xml version="1.0" encoding="UTF-8"?>
<fme:FeatureCollection xmlns:fme="http://www.safe.com/gml/fme" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:gml="http://www.opengis.net/gml" xsi:schemaLocation="Материалы по обоснованию в виде карт_зоуит.xsd" gml:id="id68832441-c8a7-416d-b710-eff916da9063">
    <gml:boundedBy>
        <gml:Envelope srsName="EPSG:3857">
            <gml:lowerCorner>3615623.78979612 5525434.7574937</gml:lowerCorner>
            <gml:upperCorner>4079522.52486935 5818431.03915138</gml:upperCorner>
        </gml:Envelope>
    </gml:boundedBy>
    <fme:featureMember>
        <fme:EngProtectionZone gml:id="id753afbb0-9ac0-4901-ad38-dd1700a611e8">
            <fme:GLOBALID>acaeb76d-5364-4ae3-a3c3-7991c6b8a7a8</fme:GLOBALID>
            <fme:CLASSID>603010503</fme:CLASSID>
            <fme:ZONE_DESC>0.00</fme:ZONE_DESC>
            <fme:OBJECTNAME>Охранная зона инженерных коммуникаций</fme:OBJECTNAME>
            <fme:SOURCE>z</fme:SOURCE>
            <fme:NOTE>91:04-6.127</fme:NOTE>
            <fme:STATUS>1</fme:STATUS>
           <gml:Curve srsName="EPSG:3857">
                <gml:segments>
                    <gml:LineStringSegment>
                        <gml:posList srsDimension="2" count="39">5015352.420000000 5342504.970000000 5015378.880000000
                            5342406.639000000 5015402.559000000 5342300.859000000 5015494.479000000 5341979.361000000
                            5015500.530000000 5341958.181000000 5015516.349000000 5341919.661000000 5015519.400000000
                            5341911.090000000 5015523.249000000 5341881.720000000 5015506.260000000 5341880.100000000
                            5015497.860000000 5341869.009000000 5015501.649000000 5341818.969000000 5015510.460000000
                            5341820.451000000 5015524.470000000 5341738.530000000 5015534.571000000 5341671.930000000
                            5015558.430000000 5341568.730000000 5015539.059000000 5341564.881000000 5015542.902000000
                            5341548.687000000 5015556.759000000 5341551.930000000 5015671.731000000 5341575.051000000
                            5015684.760000000 5341582.899000000 5015718.801000000 5341607.829000000 5015746.089000000
                            5341651.311000000 5015802.891000000 5341748.490000000 5015828.631000000 5341776.951000000
                            5015867.019000000 5341806.960000000 5015853.879000000 5341839.300000000 5015835.690000000
                            5341866.231000000 5015794.941000000 5341890.480000000 5015766.120000000 5341929.909000000
                            5015733.111000000 5341968.669000000 5015728.731000000 5341986.180000000 5015737.329000000
                            5342003.691000000 5015792.040000000 5342008.179000000 5015896.371000000 5342381.841000000
                            5015700.081000000 5342441.511000000 5015467.221000000 5342434.740000000 5015421.831000000
                            5342470.971000000 5015382.279000000 5342490.321000000 5015352.420000000 5342504.970000000
                        </gml:posList>
                    </gml:LineStringSegment>
                </gml:segments>
            </gml:Curve>
        </fme:EngProtectionZone>
    </fme:featureMember>
</fme:FeatureCollection>